config/Documents/ИзмененияВКонфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ИзмененияВКонфигурации</Name>
			<BasedOn>
				<xr:Item>Document.Задачи</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>База</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Базы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзменений</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Добавлено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектКонфигурации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементыОбъектаКонфигурации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭлементыОбъектовКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Задачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеИзменений</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзмененияВСтруктуреЭлемента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инициатор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ответственные</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ответственные</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/InformationRegisters/ИзмененияВКонфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияВКонфигурации</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Добавлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзмененияВСтруктуреЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ответственные</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ответственные</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументИзменений</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзмененияВКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлементыОбъектаКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыОбъектовКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/Documents/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>Задачи</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ответственные</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыЗадачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>База</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Базы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектКонфигурации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементыОбъектаКонфигурации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭлементыОбъектовКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеИзменений</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзмененияВСтруктуреЭлемента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Добавление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ответственные</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/Documents/ИзмененияВКонфигурации/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ИзмененияВКонфигурации
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ИзмененияВКонфигурации");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Изменения; 
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("База","База");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ОбъектМетаданных","ОбъектМетаданных");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ОбъектКонфигурации","ОбъектКонфигурации");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ЭлементыОбъектаКонфигурации","ЭлементыОбъектаКонфигурации");
	Блокировка.Заблокировать();
	
	//РегистрыСведений.ИзмененияВКонфигурации.Записывать = Истина;
	НаборЗаписей = РегистрыСведений.ИзмененияВКонфигурации.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументИзменений.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для Каждого ТекСтрокаИзменения Из Изменения Цикл
		Движение = НаборЗаписей.Добавить();
		Движение.Период = Дата;
		Движение.База = ТекСтрокаИзменения.База;
		Движение.ОбъектМетаданных = ТекСтрокаИзменения.ОбъектМетаданных;
		Движение.ОбъектКонфигурации = ТекСтрокаИзменения.ОбъектКонфигурации;
		Движение.ЭлементыОбъектаКонфигурации = ТекСтрокаИзменения.ЭлементыОбъектаКонфигурации;
		Движение.ДокументИзменений = Ссылка;
		Движение.ОписаниеИзменений = ТекСтрокаИзменения.ОписаниеИзменений;
		Движение.Изменено = ТекСтрокаИзменения.Изменено;
		Движение.Добавлено = ТекСтрокаИзменения.Добавлено;
		Движение.ДатаИзменений = ТекСтрокаИзменения.ДатаИзменений;
		Движение.ИзмененияВСтруктуреЭлемента = ТекСтрокаИзменения.ИзмененияВСтруктуреЭлемента;
		Движение.Задача = ТекСтрокаИзменения.Задача;
		Движение.Инициатор = ТекСтрокаИзменения.Инициатор;
		Движение.Исполнитель = ТекСтрокаИзменения.Исполнитель;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Задачи") 
		или (ТипЗнч(ДанныеЗаполнения) = Тип("Массив") 
			и ДанныеЗаполнения.Количество() > 0 
			И ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.Задачи")) Тогда
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());

		Запрос.Текст = "ВЫБРАТЬ
		               |	&ТекущаяДата КАК ДатаИзменений,
		               |	ЗадачиОбъектыЗадачи.База КАК База,
		               |	ЗадачиОбъектыЗадачи.Ссылка КАК Задача,
		               |	ЗадачиОбъектыЗадачи.Ссылка.Инициатор КАК Инициатор,
		               |	ЗадачиОбъектыЗадачи.Исполнитель КАК Исполнитель,
		               |	ЗадачиОбъектыЗадачи.Добавление КАК Добавлено,
		               |	ЗадачиОбъектыЗадачи.Изменение КАК Изменено,
		               |	ЗадачиОбъектыЗадачи.ИзмененияВСтруктуреЭлемента КАК ИзмененияВСтруктуреЭлемента,
		               |	ЗадачиОбъектыЗадачи.ОбъектМетаданных КАК ОбъектМетаданных,
		               |	ЗадачиОбъектыЗадачи.ОбъектКонфигурации КАК ОбъектКонфигурации,
		               |	ЗадачиОбъектыЗадачи.ОписаниеИзменений КАК ОписаниеИзменений,
		               |	ЗадачиОбъектыЗадачи.ЭлементыОбъектаКонфигурации КАК ЭлементыОбъектаКонфигурации
		               |ИЗ
		               |	Документ.Задачи.ОбъектыЗадачи КАК ЗадачиОбъектыЗадачи
		               |ГДЕ
		               |	ЗадачиОбъектыЗадачи.Ссылка "+?(ТипЗнч(ДанныеЗаполнения) = Тип("Массив"), " В ", " = ")+" &ДанныеЗаполнения";
		Выборка = Запрос.Выполнить().Выбрать();
		
		База = "";
		// Заполнение шапки
		Пока Выборка.Следующий() Цикл
			База = Выборка.База;
			НоваяСтрока = Изменения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
		Комментарий = "" 
					+ База 
					+ ?(ПустаяСтрока(База), "", ":") 
					+ ДанныеЗаполнения.ОписаниеЗадачи 
					+ ?(не ПустаяСтрока(ДанныеЗаполнения.ОписаниеЗадачи) 
						и не ПустаяСтрока(ДанныеЗаполнения.Комментарий), "; ","")
					+ ДанныеЗаполнения.Комментарий;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
